7767517
526 625
Input                    in0                      0 1 in0
Convolution              conv_4                   1 1 in0 1 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=1728
Swish                    silu_173                 1 1 1 2
Convolution              conv_5                   1 1 2 3 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=73728
Swish                    silu_174                 1 1 3 4
Convolution              conv_6                   1 1 4 5 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_175                 1 1 5 6
Slice                    split_0                  1 2 6 7 8 -23300=2,64,64 1=0
Split                    splitncnn_0              1 3 8 9 10 11
Convolution              conv_7                   1 1 11 12 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_176                 1 1 12 13
Split                    splitncnn_1              1 2 13 14 15
Convolution              conv_8                   1 1 15 16 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_177                 1 1 16 17
Convolution              conv_9                   1 1 17 18 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_178                 1 1 18 19
BinaryOp                 add_0                    2 1 14 19 20 0=0
Split                    splitncnn_2              1 2 20 21 22
Convolution              conv_10                  1 1 22 23 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_179                 1 1 23 24
Convolution              conv_11                  1 1 24 25 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_180                 1 1 25 26
BinaryOp                 add_1                    2 1 21 26 27 0=0
Convolution              conv_12                  1 1 10 28 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_181                 1 1 28 29
Concat                   cat_0                    2 1 27 29 30 0=0
Convolution              conv_13                  1 1 30 31 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_182                 1 1 31 32
Split                    splitncnn_3              1 3 32 33 34 35
Convolution              conv_14                  1 1 35 36 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_183                 1 1 36 37
Split                    splitncnn_4              1 2 37 38 39
Convolution              conv_15                  1 1 39 40 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_184                 1 1 40 41
Convolution              conv_16                  1 1 41 42 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_185                 1 1 42 43
BinaryOp                 add_2                    2 1 38 43 44 0=0
Split                    splitncnn_5              1 2 44 45 46
Convolution              conv_17                  1 1 46 47 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_186                 1 1 47 48
Convolution              conv_18                  1 1 48 49 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_187                 1 1 49 50
BinaryOp                 add_3                    2 1 45 50 51 0=0
Convolution              conv_19                  1 1 34 52 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_188                 1 1 52 53
Concat                   cat_1                    2 1 51 53 54 0=0
Convolution              conv_20                  1 1 54 55 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_189                 1 1 55 56
Concat                   cat_2                    4 1 7 9 33 56 57 0=0
Convolution              conv_21                  1 1 57 58 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_190                 1 1 58 59
Convolution              conv_22                  1 1 59 60 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=589824
Swish                    silu_191                 1 1 60 61
Convolution              conv_23                  1 1 61 62 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_192                 1 1 62 63
Slice                    split_1                  1 2 63 64 65 -23300=2,128,128 1=0
Split                    splitncnn_6              1 3 65 66 67 68
Convolution              conv_24                  1 1 68 69 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_193                 1 1 69 70
Split                    splitncnn_7              1 2 70 71 72
Convolution              conv_25                  1 1 72 73 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_194                 1 1 73 74
Convolution              conv_26                  1 1 74 75 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_195                 1 1 75 76
BinaryOp                 add_4                    2 1 71 76 77 0=0
Split                    splitncnn_8              1 2 77 78 79
Convolution              conv_27                  1 1 79 80 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_196                 1 1 80 81
Convolution              conv_28                  1 1 81 82 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_197                 1 1 82 83
BinaryOp                 add_5                    2 1 78 83 84 0=0
Convolution              conv_29                  1 1 67 85 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_198                 1 1 85 86
Concat                   cat_3                    2 1 84 86 87 0=0
Convolution              conv_30                  1 1 87 88 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_199                 1 1 88 89
Split                    splitncnn_9              1 3 89 90 91 92
Convolution              conv_31                  1 1 92 93 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_200                 1 1 93 94
Split                    splitncnn_10             1 2 94 95 96
Convolution              conv_32                  1 1 96 97 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_201                 1 1 97 98
Convolution              conv_33                  1 1 98 99 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_202                 1 1 99 100
BinaryOp                 add_6                    2 1 95 100 101 0=0
Split                    splitncnn_11             1 2 101 102 103
Convolution              conv_34                  1 1 103 104 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_203                 1 1 104 105
Convolution              conv_35                  1 1 105 106 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_204                 1 1 106 107
BinaryOp                 add_7                    2 1 102 107 108 0=0
Convolution              conv_36                  1 1 91 109 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_205                 1 1 109 110
Concat                   cat_4                    2 1 108 110 111 0=0
Convolution              conv_37                  1 1 111 112 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_206                 1 1 112 113
Concat                   cat_5                    4 1 64 66 90 113 114 0=0
Convolution              conv_38                  1 1 114 115 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Swish                    silu_207                 1 1 115 116
Split                    splitncnn_12             1 2 116 117 118
Convolution              conv_39                  1 1 118 119 0=512 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=2359296
Swish                    silu_208                 1 1 119 120
Convolution              conv_40                  1 1 120 121 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Swish                    silu_209                 1 1 121 122
Slice                    split_2                  1 2 122 123 124 -23300=2,256,256 1=0
Split                    splitncnn_13             1 3 124 125 126 127
Convolution              conv_41                  1 1 127 128 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_210                 1 1 128 129
Split                    splitncnn_14             1 2 129 130 131
Convolution              conv_42                  1 1 131 132 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_211                 1 1 132 133
Convolution              conv_43                  1 1 133 134 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_212                 1 1 134 135
BinaryOp                 add_8                    2 1 130 135 136 0=0
Split                    splitncnn_15             1 2 136 137 138
Convolution              conv_44                  1 1 138 139 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_213                 1 1 139 140
Convolution              conv_45                  1 1 140 141 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_214                 1 1 141 142
BinaryOp                 add_9                    2 1 137 142 143 0=0
Convolution              conv_46                  1 1 126 144 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_215                 1 1 144 145
Concat                   cat_6                    2 1 143 145 146 0=0
Convolution              conv_47                  1 1 146 147 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_216                 1 1 147 148
Split                    splitncnn_16             1 3 148 149 150 151
Convolution              conv_48                  1 1 151 152 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_217                 1 1 152 153
Split                    splitncnn_17             1 2 153 154 155
Convolution              conv_49                  1 1 155 156 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_218                 1 1 156 157
Convolution              conv_50                  1 1 157 158 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_219                 1 1 158 159
BinaryOp                 add_10                   2 1 154 159 160 0=0
Split                    splitncnn_18             1 2 160 161 162
Convolution              conv_51                  1 1 162 163 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_220                 1 1 163 164
Convolution              conv_52                  1 1 164 165 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_221                 1 1 165 166
BinaryOp                 add_11                   2 1 161 166 167 0=0
Convolution              conv_53                  1 1 150 168 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_222                 1 1 168 169
Concat                   cat_7                    2 1 167 169 170 0=0
Convolution              conv_54                  1 1 170 171 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_223                 1 1 171 172
Concat                   cat_8                    4 1 123 125 149 172 173 0=0
Convolution              conv_55                  1 1 173 174 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
Swish                    silu_224                 1 1 174 175
Split                    splitncnn_19             1 2 175 176 177
Convolution              conv_56                  1 1 177 178 0=512 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=2359296
Swish                    silu_225                 1 1 178 179
Convolution              conv_57                  1 1 179 180 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Swish                    silu_226                 1 1 180 181
Slice                    split_3                  1 2 181 182 183 -23300=2,256,256 1=0
Split                    splitncnn_20             1 3 183 184 185 186
Convolution              conv_58                  1 1 186 187 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_227                 1 1 187 188
Split                    splitncnn_21             1 2 188 189 190
Convolution              conv_59                  1 1 190 191 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_228                 1 1 191 192
Convolution              conv_60                  1 1 192 193 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_229                 1 1 193 194
BinaryOp                 add_12                   2 1 189 194 195 0=0
Split                    splitncnn_22             1 2 195 196 197
Convolution              conv_61                  1 1 197 198 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_230                 1 1 198 199
Convolution              conv_62                  1 1 199 200 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_231                 1 1 200 201
BinaryOp                 add_13                   2 1 196 201 202 0=0
Convolution              conv_63                  1 1 185 203 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_232                 1 1 203 204
Concat                   cat_9                    2 1 202 204 205 0=0
Convolution              conv_64                  1 1 205 206 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_233                 1 1 206 207
Split                    splitncnn_23             1 3 207 208 209 210
Convolution              conv_65                  1 1 210 211 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_234                 1 1 211 212
Split                    splitncnn_24             1 2 212 213 214
Convolution              conv_66                  1 1 214 215 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_235                 1 1 215 216
Convolution              conv_67                  1 1 216 217 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_236                 1 1 217 218
BinaryOp                 add_14                   2 1 213 218 219 0=0
Split                    splitncnn_25             1 2 219 220 221
Convolution              conv_68                  1 1 221 222 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_237                 1 1 222 223
Convolution              conv_69                  1 1 223 224 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_238                 1 1 224 225
BinaryOp                 add_15                   2 1 220 225 226 0=0
Convolution              conv_70                  1 1 209 227 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_239                 1 1 227 228
Concat                   cat_10                   2 1 226 228 229 0=0
Convolution              conv_71                  1 1 229 230 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_240                 1 1 230 231
Concat                   cat_11                   4 1 182 184 208 231 232 0=0
Convolution              conv_72                  1 1 232 233 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
Swish                    silu_241                 1 1 233 234
Convolution              conv_73                  1 1 234 235 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_242                 1 1 235 236
Split                    splitncnn_26             1 2 236 237 238
Pooling                  maxpool2d_170            1 1 238 239 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_27             1 2 239 240 241
Pooling                  maxpool2d_171            1 1 241 242 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_28             1 2 242 243 244
Pooling                  maxpool2d_172            1 1 244 245 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Concat                   cat_12                   4 1 237 240 243 245 246 0=0
Convolution              conv_74                  1 1 246 247 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
Swish                    silu_243                 1 1 247 248
Convolution              conv_75                  1 1 248 249 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Swish                    silu_244                 1 1 249 250
Slice                    split_4                  1 2 250 251 252 -23300=2,256,256 1=0
Split                    splitncnn_29             1 2 252 253 254
Convolution              conv_76                  1 1 254 255 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Reshape                  view_337                 1 1 255 256 0=400 1=128 2=4
Slice                    split_5                  1 3 256 257 258 259 -23300=3,32,32,64 1=1
Split                    splitncnn_30             1 2 259 260 261
Permute                  transpose_350            1 1 257 262 0=1
MatMul                   matmul_346               2 1 262 258 263
BinaryOp                 mul_16                   1 1 263 264 0=2 1=1 2=1.767767e-01
Softmax                  softmax_1                1 1 264 265 0=2 1=1
MatMul                   matmultransb_0           2 1 261 265 266 0=1
Reshape                  view_338                 1 1 266 267 0=20 1=20 2=256
Reshape                  reshape_334              1 1 260 268 0=20 1=20 2=256
ConvolutionDepthWise     convdw_355               1 1 268 269 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256
BinaryOp                 add_17                   2 1 267 269 270 0=0
Convolution              conv_77                  1 1 270 271 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
BinaryOp                 add_18                   2 1 253 271 272 0=0
Split                    splitncnn_31             1 2 272 273 274
Convolution              conv_78                  1 1 274 275 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_245                 1 1 275 276
Convolution              conv_79                  1 1 276 277 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
BinaryOp                 add_19                   2 1 273 277 278 0=0
Split                    splitncnn_32             1 2 278 279 280
Convolution              conv_80                  1 1 280 281 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Reshape                  view_339                 1 1 281 282 0=400 1=128 2=4
Slice                    split_6                  1 3 282 283 284 285 -23300=3,32,32,64 1=1
Split                    splitncnn_33             1 2 285 286 287
Permute                  transpose_352            1 1 283 288 0=1
MatMul                   matmul_348               2 1 288 284 289
BinaryOp                 mul_20                   1 1 289 290 0=2 1=1 2=1.767767e-01
Softmax                  softmax_2                1 1 290 291 0=2 1=1
MatMul                   matmultransb_1           2 1 287 291 292 0=1
Reshape                  view_340                 1 1 292 293 0=20 1=20 2=256
Reshape                  reshape_335              1 1 286 294 0=20 1=20 2=256
ConvolutionDepthWise     convdw_356               1 1 294 295 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256
BinaryOp                 add_21                   2 1 293 295 296 0=0
Convolution              conv_81                  1 1 296 297 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
BinaryOp                 add_22                   2 1 279 297 298 0=0
Split                    splitncnn_34             1 2 298 299 300
Convolution              conv_82                  1 1 300 301 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_246                 1 1 301 302
Convolution              conv_83                  1 1 302 303 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
BinaryOp                 add_23                   2 1 299 303 304 0=0
Concat                   cat_13                   2 1 251 304 305 0=0
Convolution              conv_84                  1 1 305 306 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Swish                    silu_247                 1 1 306 307
Split                    splitncnn_35             1 2 307 308 309
Interp                   upsample_332             1 1 309 310 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_14                   2 1 310 176 311 0=0
Convolution              conv_85                  1 1 311 312 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
Swish                    silu_248                 1 1 312 313
Slice                    split_7                  1 2 313 314 315 -23300=2,256,256 1=0
Split                    splitncnn_36             1 3 315 316 317 318
Convolution              conv_86                  1 1 318 319 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_249                 1 1 319 320
Split                    splitncnn_37             1 2 320 321 322
Convolution              conv_87                  1 1 322 323 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_250                 1 1 323 324
Convolution              conv_88                  1 1 324 325 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_251                 1 1 325 326
BinaryOp                 add_24                   2 1 321 326 327 0=0
Split                    splitncnn_38             1 2 327 328 329
Convolution              conv_89                  1 1 329 330 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_252                 1 1 330 331
Convolution              conv_90                  1 1 331 332 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_253                 1 1 332 333
BinaryOp                 add_25                   2 1 328 333 334 0=0
Convolution              conv_91                  1 1 317 335 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_254                 1 1 335 336
Concat                   cat_15                   2 1 334 336 337 0=0
Convolution              conv_92                  1 1 337 338 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_255                 1 1 338 339
Split                    splitncnn_39             1 3 339 340 341 342
Convolution              conv_93                  1 1 342 343 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_256                 1 1 343 344
Split                    splitncnn_40             1 2 344 345 346
Convolution              conv_94                  1 1 346 347 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_257                 1 1 347 348
Convolution              conv_95                  1 1 348 349 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_258                 1 1 349 350
BinaryOp                 add_26                   2 1 345 350 351 0=0
Split                    splitncnn_41             1 2 351 352 353
Convolution              conv_96                  1 1 353 354 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_259                 1 1 354 355
Convolution              conv_97                  1 1 355 356 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_260                 1 1 356 357
BinaryOp                 add_27                   2 1 352 357 358 0=0
Convolution              conv_98                  1 1 341 359 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_261                 1 1 359 360
Concat                   cat_16                   2 1 358 360 361 0=0
Convolution              conv_99                  1 1 361 362 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_262                 1 1 362 363
Concat                   cat_17                   4 1 314 316 340 363 364 0=0
Convolution              conv_100                 1 1 364 365 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
Swish                    silu_263                 1 1 365 366
Split                    splitncnn_42             1 2 366 367 368
Interp                   upsample_333             1 1 368 369 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_18                   2 1 369 117 370 0=0
Convolution              conv_101                 1 1 370 371 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Swish                    silu_264                 1 1 371 372
Slice                    split_8                  1 2 372 373 374 -23300=2,128,128 1=0
Split                    splitncnn_43             1 3 374 375 376 377
Convolution              conv_102                 1 1 377 378 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_265                 1 1 378 379
Split                    splitncnn_44             1 2 379 380 381
Convolution              conv_103                 1 1 381 382 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_266                 1 1 382 383
Convolution              conv_104                 1 1 383 384 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_267                 1 1 384 385
BinaryOp                 add_28                   2 1 380 385 386 0=0
Split                    splitncnn_45             1 2 386 387 388
Convolution              conv_105                 1 1 388 389 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_268                 1 1 389 390
Convolution              conv_106                 1 1 390 391 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_269                 1 1 391 392
BinaryOp                 add_29                   2 1 387 392 393 0=0
Convolution              conv_107                 1 1 376 394 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_270                 1 1 394 395
Concat                   cat_19                   2 1 393 395 396 0=0
Convolution              conv_108                 1 1 396 397 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_271                 1 1 397 398
Split                    splitncnn_46             1 3 398 399 400 401
Convolution              conv_109                 1 1 401 402 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_272                 1 1 402 403
Split                    splitncnn_47             1 2 403 404 405
Convolution              conv_110                 1 1 405 406 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_273                 1 1 406 407
Convolution              conv_111                 1 1 407 408 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_274                 1 1 408 409
BinaryOp                 add_30                   2 1 404 409 410 0=0
Split                    splitncnn_48             1 2 410 411 412
Convolution              conv_112                 1 1 412 413 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_275                 1 1 413 414
Convolution              conv_113                 1 1 414 415 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_276                 1 1 415 416
BinaryOp                 add_31                   2 1 411 416 417 0=0
Convolution              conv_114                 1 1 400 418 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_277                 1 1 418 419
Concat                   cat_20                   2 1 417 419 420 0=0
Convolution              conv_115                 1 1 420 421 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_278                 1 1 421 422
Concat                   cat_21                   4 1 373 375 399 422 423 0=0
Convolution              conv_116                 1 1 423 424 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_279                 1 1 424 425
Split                    splitncnn_49             1 3 425 426 427 428
Convolution              conv_117                 1 1 427 429 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=589824
Swish                    silu_280                 1 1 429 430
Concat                   cat_22                   2 1 430 367 431 0=0
Convolution              conv_118                 1 1 431 432 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=393216
Swish                    silu_281                 1 1 432 433
Slice                    split_9                  1 2 433 434 435 -23300=2,256,256 1=0
Split                    splitncnn_50             1 3 435 436 437 438
Convolution              conv_119                 1 1 438 439 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_282                 1 1 439 440
Split                    splitncnn_51             1 2 440 441 442
Convolution              conv_120                 1 1 442 443 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_283                 1 1 443 444
Convolution              conv_121                 1 1 444 445 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_284                 1 1 445 446
BinaryOp                 add_32                   2 1 441 446 447 0=0
Split                    splitncnn_52             1 2 447 448 449
Convolution              conv_122                 1 1 449 450 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_285                 1 1 450 451
Convolution              conv_123                 1 1 451 452 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_286                 1 1 452 453
BinaryOp                 add_33                   2 1 448 453 454 0=0
Convolution              conv_124                 1 1 437 455 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_287                 1 1 455 456
Concat                   cat_23                   2 1 454 456 457 0=0
Convolution              conv_125                 1 1 457 458 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_288                 1 1 458 459
Split                    splitncnn_53             1 3 459 460 461 462
Convolution              conv_126                 1 1 462 463 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_289                 1 1 463 464
Split                    splitncnn_54             1 2 464 465 466
Convolution              conv_127                 1 1 466 467 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_290                 1 1 467 468
Convolution              conv_128                 1 1 468 469 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_291                 1 1 469 470
BinaryOp                 add_34                   2 1 465 470 471 0=0
Split                    splitncnn_55             1 2 471 472 473
Convolution              conv_129                 1 1 473 474 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_292                 1 1 474 475
Convolution              conv_130                 1 1 475 476 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_293                 1 1 476 477
BinaryOp                 add_35                   2 1 472 477 478 0=0
Convolution              conv_131                 1 1 461 479 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_294                 1 1 479 480
Concat                   cat_24                   2 1 478 480 481 0=0
Convolution              conv_132                 1 1 481 482 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_295                 1 1 482 483
Concat                   cat_25                   4 1 434 436 460 483 484 0=0
Convolution              conv_133                 1 1 484 485 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
Swish                    silu_296                 1 1 485 486
Split                    splitncnn_56             1 3 486 487 488 489
Convolution              conv_134                 1 1 488 490 0=512 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=2359296
Swish                    silu_297                 1 1 490 491
Concat                   cat_26                   2 1 491 308 492 0=0
Convolution              conv_135                 1 1 492 493 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
Swish                    silu_298                 1 1 493 494
Slice                    split_10                 1 2 494 495 496 -23300=2,256,256 1=0
Split                    splitncnn_57             1 3 496 497 498 499
Convolution              conv_136                 1 1 499 500 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_299                 1 1 500 501
Split                    splitncnn_58             1 2 501 502 503
Convolution              conv_137                 1 1 503 504 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_300                 1 1 504 505
Convolution              conv_138                 1 1 505 506 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_301                 1 1 506 507
BinaryOp                 add_36                   2 1 502 507 508 0=0
Split                    splitncnn_59             1 2 508 509 510
Convolution              conv_139                 1 1 510 511 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_302                 1 1 511 512
Convolution              conv_140                 1 1 512 513 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_303                 1 1 513 514
BinaryOp                 add_37                   2 1 509 514 515 0=0
Convolution              conv_141                 1 1 498 516 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_304                 1 1 516 517
Concat                   cat_27                   2 1 515 517 518 0=0
Convolution              conv_142                 1 1 518 519 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_305                 1 1 519 520
Split                    splitncnn_60             1 3 520 521 522 523
Convolution              conv_143                 1 1 523 524 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_306                 1 1 524 525
Split                    splitncnn_61             1 2 525 526 527
Convolution              conv_144                 1 1 527 528 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_307                 1 1 528 529
Convolution              conv_145                 1 1 529 530 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_308                 1 1 530 531
BinaryOp                 add_38                   2 1 526 531 532 0=0
Split                    splitncnn_62             1 2 532 533 534
Convolution              conv_146                 1 1 534 535 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_309                 1 1 535 536
Convolution              conv_147                 1 1 536 537 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_310                 1 1 537 538
BinaryOp                 add_39                   2 1 533 538 539 0=0
Convolution              conv_148                 1 1 522 540 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_311                 1 1 540 541
Concat                   cat_28                   2 1 539 541 542 0=0
Convolution              conv_149                 1 1 542 543 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_312                 1 1 543 544
Concat                   cat_29                   4 1 495 497 521 544 545 0=0
Convolution              conv_150                 1 1 545 546 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
Swish                    silu_313                 1 1 546 547
Split                    splitncnn_63             1 2 547 548 549
MemoryData               pnnx_330                 0 1 550 0=8400
Convolution              conv_151                 1 1 426 551 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_314                 1 1 551 552
Convolution              conv_152                 1 1 552 553 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_315                 1 1 553 554
Convolution              conv_153                 1 1 554 555 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
ConvolutionDepthWise     convdw_357               1 1 428 556 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256
Swish                    silu_316                 1 1 556 557
Convolution              conv_154                 1 1 557 558 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_317                 1 1 558 559
ConvolutionDepthWise     convdw_358               1 1 559 560 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256
Swish                    silu_318                 1 1 560 561
Convolution              conv_155                 1 1 561 562 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_319                 1 1 562 563
Convolution              conv_156                 1 1 563 564 0=6 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1536
Concat                   cat_30                   2 1 555 564 565 0=0
Convolution              conv_157                 1 1 487 566 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912
Swish                    silu_320                 1 1 566 567
Convolution              conv_158                 1 1 567 568 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_321                 1 1 568 569
Convolution              conv_159                 1 1 569 570 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
ConvolutionDepthWise     convdw_359               1 1 489 571 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608 7=512
Swish                    silu_322                 1 1 571 572
Convolution              conv_160                 1 1 572 573 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_323                 1 1 573 574
ConvolutionDepthWise     convdw_360               1 1 574 575 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256
Swish                    silu_324                 1 1 575 576
Convolution              conv_161                 1 1 576 577 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_325                 1 1 577 578
Convolution              conv_162                 1 1 578 579 0=6 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1536
Concat                   cat_31                   2 1 570 579 580 0=0
Convolution              conv_163                 1 1 548 581 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912
Swish                    silu_326                 1 1 581 582
Convolution              conv_164                 1 1 582 583 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_327                 1 1 583 584
Convolution              conv_165                 1 1 584 585 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
ConvolutionDepthWise     convdw_361               1 1 549 586 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608 7=512
Swish                    silu_328                 1 1 586 587
Convolution              conv_166                 1 1 587 588 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_329                 1 1 588 589
ConvolutionDepthWise     convdw_362               1 1 589 590 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256
Swish                    silu_330                 1 1 590 591
Convolution              conv_167                 1 1 591 592 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_331                 1 1 592 593
Convolution              conv_168                 1 1 593 594 0=6 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1536
Concat                   cat_32                   2 1 585 594 595 0=0
Reshape                  view_341                 1 1 565 596 0=6400 1=70
Reshape                  view_342                 1 1 580 597 0=1600 1=70
Reshape                  view_343                 1 1 595 598 0=400 1=70
Concat                   cat_33                   3 1 596 597 598 599 0=1
Slice                    split_11                 1 2 599 600 601 -23300=2,64,6 1=0
Reshape                  view_344                 1 1 600 602 0=8400 1=16 2=4
Permute                  transpose_354            1 1 602 603 0=2
Softmax                  softmax_3                1 1 603 604 0=0 1=1
Convolution              conv_169                 1 1 604 605 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=16
Reshape                  view_345                 1 1 605 606 0=8400 1=4
MemoryData               pnnx_fold_anchor_points.1 0 1 607 0=8400 1=2
MemoryData               pnnx_fold_anchor_points.1_1 0 1 608 0=8400 1=2
Slice                    chunk_0                  1 2 606 609 610 -23300=2,-233,-233 1=0
BinaryOp                 sub_40                   2 1 607 609 611 0=1
Split                    splitncnn_64             1 2 611 612 613
BinaryOp                 add_41                   2 1 608 610 614 0=0
Split                    splitncnn_65             1 2 614 615 616
BinaryOp                 add_42                   2 1 612 615 617 0=0
BinaryOp                 div_43                   1 1 617 618 0=3 1=1 2=2.000000e+00
BinaryOp                 sub_44                   2 1 616 613 619 0=1
Concat                   cat_34                   2 1 618 619 620 0=0
Reshape                  reshape_336              1 1 550 621 0=8400 1=1
BinaryOp                 mul_45                   2 1 620 621 622 0=2
Sigmoid                  sigmoid_0                1 1 601 623
Concat                   cat_35                   2 1 622 623 out0 0=0
